benchmarks/results/pairs/django/grit-mixed-1.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/bench.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 40s max duration (incl. graceful stop):
              * mixed: 50 looping VUs for 30s (exec: mixed, gracefulStop: 10s)


running (01.0s), 50/50 VUs, 687 complete and 0 interrupted iterations
mixed   [   3% ] 50 VUs  01.0s/30s

running (02.0s), 50/50 VUs, 1381 complete and 0 interrupted iterations
mixed   [   7% ] 50 VUs  02.0s/30s

running (03.0s), 50/50 VUs, 2001 complete and 0 interrupted iterations
mixed   [  10% ] 50 VUs  03.0s/30s

running (04.0s), 50/50 VUs, 2617 complete and 0 interrupted iterations
mixed   [  13% ] 50 VUs  04.0s/30s

running (05.0s), 50/50 VUs, 3298 complete and 0 interrupted iterations
mixed   [  17% ] 50 VUs  05.0s/30s

running (06.0s), 50/50 VUs, 3983 complete and 0 interrupted iterations
mixed   [  20% ] 50 VUs  06.0s/30s

running (07.0s), 50/50 VUs, 4600 complete and 0 interrupted iterations
mixed   [  23% ] 50 VUs  07.0s/30s

running (08.0s), 50/50 VUs, 5233 complete and 0 interrupted iterations
mixed   [  27% ] 50 VUs  08.0s/30s

running (09.0s), 50/50 VUs, 5868 complete and 0 interrupted iterations
mixed   [  30% ] 50 VUs  09.0s/30s

running (10.0s), 50/50 VUs, 6248 complete and 0 interrupted iterations
mixed   [  33% ] 50 VUs  10.0s/30s

running (11.0s), 50/50 VUs, 6779 complete and 0 interrupted iterations
mixed   [  37% ] 50 VUs  11.0s/30s

running (12.0s), 50/50 VUs, 7337 complete and 0 interrupted iterations
mixed   [  40% ] 50 VUs  12.0s/30s

running (13.0s), 50/50 VUs, 7868 complete and 0 interrupted iterations
mixed   [  43% ] 50 VUs  13.0s/30s

running (14.0s), 50/50 VUs, 8380 complete and 0 interrupted iterations
mixed   [  47% ] 50 VUs  14.0s/30s

running (15.0s), 50/50 VUs, 8707 complete and 0 interrupted iterations
mixed   [  50% ] 50 VUs  15.0s/30s

running (16.0s), 50/50 VUs, 9136 complete and 0 interrupted iterations
mixed   [  53% ] 50 VUs  16.0s/30s

running (17.0s), 50/50 VUs, 9568 complete and 0 interrupted iterations
mixed   [  57% ] 50 VUs  17.0s/30s

running (18.0s), 50/50 VUs, 10000 complete and 0 interrupted iterations
mixed   [  60% ] 50 VUs  18.0s/30s

running (19.0s), 50/50 VUs, 10403 complete and 0 interrupted iterations
mixed   [  63% ] 50 VUs  19.0s/30s

running (20.0s), 50/50 VUs, 10816 complete and 0 interrupted iterations
mixed   [  67% ] 50 VUs  20.0s/30s

running (21.0s), 50/50 VUs, 11209 complete and 0 interrupted iterations
mixed   [  70% ] 50 VUs  21.0s/30s

running (22.0s), 50/50 VUs, 11636 complete and 0 interrupted iterations
mixed   [  73% ] 50 VUs  22.0s/30s

running (23.0s), 50/50 VUs, 12053 complete and 0 interrupted iterations
mixed   [  77% ] 50 VUs  23.0s/30s

running (24.0s), 50/50 VUs, 12459 complete and 0 interrupted iterations
mixed   [  80% ] 50 VUs  24.0s/30s

running (25.0s), 50/50 VUs, 12858 complete and 0 interrupted iterations
mixed   [  83% ] 50 VUs  25.0s/30s

running (26.0s), 50/50 VUs, 13257 complete and 0 interrupted iterations
mixed   [  87% ] 50 VUs  26.0s/30s

running (27.0s), 50/50 VUs, 13643 complete and 0 interrupted iterations
mixed   [  90% ] 50 VUs  27.0s/30s

running (28.0s), 50/50 VUs, 14069 complete and 0 interrupted iterations
mixed   [  93% ] 50 VUs  28.0s/30s

running (29.0s), 50/50 VUs, 14529 complete and 0 interrupted iterations
mixed   [  97% ] 50 VUs  29.0s/30s

running (30.0s), 50/50 VUs, 14967 complete and 0 interrupted iterations
mixed   [ 100% ] 50 VUs  30.0s/30s


  █ THRESHOLDS 

    failed_requests
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 30050   998.64758/s
    checks_succeeded...: 100.00% 30050 out of 30050
    checks_failed......: 0.00%   0 out of 30050

    ✓ status ok
    ✓ has data

    CUSTOM
    failed_requests................: 0.00%  0 out of 15025
    ttfb...........................: avg=96.78ms min=816.55µs med=79.88ms max=781.41ms p(90)=190.04ms p(95)=235.03ms

    HTTP
    http_req_duration..............: avg=98.88ms min=983.64µs med=81.8ms  max=781.54ms p(90)=193.05ms p(95)=239.31ms
      { expected_response:true }...: avg=98.88ms min=983.64µs med=81.8ms  max=781.54ms p(90)=193.05ms p(95)=239.31ms
    http_req_failed................: 0.00%  0 out of 15025
    http_reqs......................: 15025  499.32379/s

    EXECUTION
    iteration_duration.............: avg=99.95ms min=1.25ms   med=82.92ms max=781.76ms p(90)=194.29ms p(95)=240.91ms
    iterations.....................: 15025  499.32379/s
    vus............................: 50     min=50         max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 92 MB  3.1 MB/s
    data_sent......................: 2.5 MB 84 kB/s



running (30.1s), 00/50 VUs, 15025 complete and 0 interrupted iterations
mixed ✓ [ 100% ] 50 VUs  30s